c5/src/Catalogs/Projects/Projects.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Projects</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Organizations</owners>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Appearance</name>
    <type>
      <types>CatalogRef.CalendarAppearance</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Completed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompletionDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Cost</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Data</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateStart</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DocumentRef.IncomingEmail</types>
      <types>DocumentRef.OutgoingEmail</types>
    </type>
  </attributes>
  <attributes>
    <name>Folder</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HourlyRate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Manager</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Minutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ObligatoryTasks</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PaidMinutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Pricing</name>
    <type>
      <types>EnumRef.ProjectsPricing</types>
    </type>
  </attributes>
  <attributes>
    <name>ProjectType</name>
    <type>
      <types>EnumRef.ProjectTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>UseApprovingProcess</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ApprovalList</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
    <attributes>
      <name>Priority</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Tasks</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>HourlyCost</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>HourlyRate</name>
      <type>
        <types>DefinedType.Rate</types>
      </type>
    </attributes>
    <attributes>
      <name>Minutes</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Task</name>
      <type>
        <types>CatalogRef.Tasks</types>
      </type>
    </attributes>
    <attributes>
      <name>TimeType</name>
      <type>
        <types>EnumRef.Time</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccessDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessRevoked</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApproveSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeInternalOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Login</name>
    <type>
      <types>CatalogRef.Logins</types>
    </type>
  </attributes>
  <attributes>
    <name>OrganizationAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>OSAuth</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OSUser</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Protection</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Show</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TimeZone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingDistance</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingPeriodicity</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingProvider</name>
    <type>
      <types>EnumRef.Providers</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingTime</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackLocation</name>
    <type>
      <types>EnumRef.Tracking</types>
    </type>
  </attributes>
  <attributes>
    <name>UserClass</name>
    <type>
      <types>EnumRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Companies</name>
    <attributes>
      <name>Company</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Organizations</name>
    <attributes>
      <name>Organization</name>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>OrganizationsStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Warehouses</name>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>WarehousesStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/Catalogs/Projects/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure OnCopy ( CopiedObject )
	
	Catalogs.Projects.SetFolder ( ThisObject );
	Completed = false;
	CompletionDate = undefined;
	CKEditorSrv.Copy ( CopiedObject, FolderID );
	
EndProcedure

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	if ( IsFolder ) then
		return;
	endif; 
	if ( not checkPeriods () ) then
		Cancel = true;
		return;
	endif; 
	if ( not checkApprovalDoubles () ) then
		Cancel = true;
		return;
	endif; 
	checkCompletionDate ( CheckedAttributes );
	checkApprovalList ( CheckedAttributes );
	checkTasks ( CheckedAttributes );
	
EndProcedure

Function checkPeriods ()
	
	if ( not Periods.Ok ( DateStart, DateEnd ) ) then
		Output.ProjectPeriodError1 ( , "DateEnd" );
		return false;
	endif;
	if ( not Periods.Ok ( DateStart, CompletionDate ) ) then
		Output.ProjectPeriodError2 ( , "CompletionDate" );
		return false;
	endif;
	return true;
	
EndFunction 

Function checkApprovalDoubles ()
	
	if ( not UseApprovingProcess ) then
		return true;
	endif; 
	doubles = Collections.GetDoubles ( ApprovalList, "User" );
	if ( doubles.Count () > 0 ) then
		for each row in doubles do
			Output.DoublesApprovalList ( , Output.Row ( "ApprovalList", row.LineNumber, "User" ) );
		enddo; 
		return false;
	endif; 
	return true;
	
EndFunction 

Procedure checkCompletionDate ( CheckedAttributes )
	
	if ( Completed ) then
		CheckedAttributes.Add ( "CompletionDate" );
	endif; 
	
EndProcedure 

Procedure checkApprovalList ( CheckedAttributes )
	
	if ( UseApprovingProcess ) then
		CheckedAttributes.Add ( "ApprovalList" );
	endif; 
	
EndProcedure 

Procedure checkTasks ( CheckedAttributes )
	
	if ( ObligatoryTasks ) then
		CheckedAttributes.Add ( "Tasks.Task" );
	endif; 
	
EndProcedure 

Procedure BeforeWrite ( Cancel )
	
	if ( DataExchange.Load ) then
		return;
	endif; 
	if ( not checkCurrency () ) then
		Cancel = true;
		return;
	endif;

EndProcedure

Function checkCurrency ()
	
	if ( not Parent.IsEmpty () ) then
		if ( DF.Pick ( Parent, "Currency" ) <> Currency ) then
			Output.ProjectCurrencyMismatch ( , "Currency", Ref );
			return false;
		endif; 
	endif; 
	if ( IsFolder and not IsNew () ) then
		if ( DF.Pick ( Ref, "Currency" ) <> Currency ) then
			selection = Catalogs.Projects.Select ( Ref, Owner );
			if ( selection.Next () ) then
				Output.IllegalFolderCurrency ( , "Currency", Ref );
				return false;
			endif; 
		endif; 
	endif; 
	return true;
	
EndFunction 

Procedure OnWrite ( Cancel )
	
	if ( IsFolder ) then
		return;
	endif; 
	if ( DataExchange.Load ) then
		return;
	endif; 
	if ( not checkApprovingUsers () ) then
		Cancel = true;
		return;
	endif; 
	makeInvoicing ();
	
EndProcedure

Function checkApprovingUsers ()
	
	if ( DeletionMark ) then
		return true;
	endif; 
	if ( not UseApprovingProcess ) then
		return true;
	endif; 
	table = getNotAuthorizedUsers ();
	if ( table.Count () > 0 ) then
		for each row in table do
			Output.UserCannotApprove ( new Structure ( "Customer", Owner ), Output.Row ( "ApprovalList", row.LineNumber, "User" ) );
		enddo; 
		return false;
	endif; 
	return true;
	
EndFunction 

Function getNotAuthorizedUsers ()
	
	s = "
	|select ApprovalList.User as User, ApprovalList.LineNumber as LineNumber
	|from Catalog.Projects.ApprovalList as ApprovalList
	|	left join Catalog.Users.Organizations as Organizations
	|	on Organizations.Ref = ApprovalList.User
	|	and Organizations.Organization = &Customer
	|where ApprovalList.Ref = &Ref
	|and ApprovalList.User.OrganizationAccess = value ( Enum.Access.Allow )
	|and Organizations.Organization is null
	|union
	|select ApprovalList.User, ApprovalList.LineNumber
	|from Catalog.Projects.ApprovalList as ApprovalList
	|	left join Catalog.Users.Organizations as Organizations
	|	on Organizations.Ref = ApprovalList.User
	|	and Organizations.Organization = &Customer
	|where ApprovalList.Ref = &Ref
	|and ApprovalList.User.OrganizationAccess = value ( Enum.Access.Forbid )
	|and Organizations.Organization is not null
	|";
	q = new Query ( s );
	q.SetParameter ( "Customer", Owner );
	q.SetParameter ( "Ref", Ref );
	table = q.Execute ().Unload ();
	return table;
	
EndFunction 

Procedure makeInvoicing ()
	
	SetPrivilegedMode ( true );
	record = InformationRegisters.ProjectInvoices.CreateRecordManager ();
	record.Project = Ref;
	record.Read ();
	if ( not record.Selected () ) then
		record.Project = Ref;
		record.Write ();
	endif; 
	SetPrivilegedMode ( false );
	
EndProcedure 

#endif
